Revit 2024 API
ScheduleDefinition.EmbeddedDefinition Property
 The embedded ScheduleDefinition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ScheduleDefinition EmbeddedDefinition { get; }
Visual Basic
Public ReadOnly Property EmbeddedDefinition As ScheduleDefinition
	Get
Visual C++
public:
property ScheduleDefinition^ EmbeddedDefinition {
	ScheduleDefinition^ get ();
}
See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace